src/storage-performance.org
#+Title: 性能测试/Performance Test

* 简述

* 名词介绍
IOPS/Throughput/Response Time/Latency/Utilization/Saturation/Bottleneck
|--------------------+------------------------|
| IOPS               | 每秒输入输出次数       |
| Throughput/带宽    | 每秒数据量             |
| Latency/延时       | 一个操作完成的所有时间 |
| Utilization/使用率 | 资源的繁忙程度         |
| Saturation/饱和度  | 等待资源服务的排队程度 |
| Bottleneck/瓶颈    | 资源限制点             |
|                    |                        |
SUT: System Undet Test
Trade-offs: Pick two:
Fast, Good, Cheap
On-Time, Inexpensive, Performance

/U=B\/T/
Cache Cold, Hot, Warm, Warmth

* Resource list
- CPU
- RAM
- Network interfaces
- Storage Devices
- Controllers
- Interconnect

* Patterns
- Linear scalability
- Contention
- Coherence
- Knee point
- scalability ceiling

* 素材搜集
** 性能影响因素
- 是否所有IO来自首选节点(preferred node)
- 测试工具vdbench/fio/iometer, OLTP/OLAP
- 不同卷是否运行不同模式
- 卷状态: RAID同步完成
- 性能统计信息搜集
- 链路层是否有错误
- 预热时间: 每盘300 IOPS, 12GB缓存实现, 96盘, 4K IO, RAID写放大3倍, 240s时间
  12G*3/300*4K*96 = 327s?
  + 影响随机+数据的测试
- 
